TexasInstruments/mcupsdk-core/test/drivers/tester/am263x-cc/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263x_beta" --package "ZCZ" --part "AM263x" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const dac             = scripting.addModule("/drivers/dac/dac", {}, false);
const dac1            = dac.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
const gpio3           = gpio.addInstance();
const gpio4           = gpio.addInstance();
const gpio5           = gpio.addInstance();
const gpio6           = gpio.addInstance();
const gpio7           = gpio.addInstance();
const gpio8           = gpio.addInstance();
const gpio9           = gpio.addInstance();
const gpio10          = gpio.addInstance();
const gpio11          = gpio.addInstance();
const gpio12          = gpio.addInstance();
const gpio13          = gpio.addInstance();
const gpio14          = gpio.addInstance();
const gpio15          = gpio.addInstance();
const gpio16          = gpio.addInstance();
const gpio17          = gpio.addInstance();
const gpio18          = gpio.addInstance();
const gpio19          = gpio.addInstance();
const gpio20          = gpio.addInstance();
const gpio21          = gpio.addInstance();
const gpio22          = gpio.addInstance();
const gpio23          = gpio.addInstance();
const gpio24          = gpio.addInstance();
const gpio25          = gpio.addInstance();
const gpio26          = gpio.addInstance();
const gpio27          = gpio.addInstance();
const gpio28          = gpio.addInstance();
const gpio29          = gpio.addInstance();
const gpio30          = gpio.addInstance();
const gpio31          = gpio.addInstance();
const gpio32          = gpio.addInstance();
const gpio33          = gpio.addInstance();
const gpio34          = gpio.addInstance();
const gpio35          = gpio.addInstance();
const gpio36          = gpio.addInstance();
const gpio37          = gpio.addInstance();
const gpio38          = gpio.addInstance();
const gpio39          = gpio.addInstance();
const gpio40          = gpio.addInstance();
const gpio41          = gpio.addInstance();
const gpio42          = gpio.addInstance();
const gpio43          = gpio.addInstance();
const gpio44          = gpio.addInstance();
const gpio45          = gpio.addInstance();
const gpio46          = gpio.addInstance();
const gpio47          = gpio.addInstance();
const gpio48          = gpio.addInstance();
const gpio49          = gpio.addInstance();
const gpio50          = gpio.addInstance();
const gpio51          = gpio.addInstance();
const gpio52          = gpio.addInstance();
const gpio53          = gpio.addInstance();
const gpio54          = gpio.addInstance();
const gpio55          = gpio.addInstance();
const gpio56          = gpio.addInstance();
const gpio57          = gpio.addInstance();
const gpio58          = gpio.addInstance();
const gpio59          = gpio.addInstance();
const gpio60          = gpio.addInstance();
const gpio61          = gpio.addInstance();
const uart            = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1           = uart.addInstance();
const clock           = scripting.addModule("/kernel/dpl/clock");
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
dac1.$name        = "CONFIG_DAC0";
dac1.enableOutput = true;

gpio1.$name          = "CAPTURE_EPWM0A";
gpio1.rx             = true;
gpio1.GPIO_n.$assign = "EPWM0_A";

gpio2.$name          = "CAPTURE_EPWM0B";
gpio2.rx             = true;
gpio2.GPIO_n.$assign = "EPWM0_B";

gpio3.$name          = "CAPTURE_EPWM1A";
gpio3.rx             = true;
gpio3.GPIO_n.$assign = "EPWM1_A";

gpio4.$name          = "CAPTURE_EPWM1B";
gpio4.rx             = true;
gpio4.GPIO_n.$assign = "EPWM1_B";

gpio5.$name          = "CAPTURE_EPWM2A";
gpio5.rx             = true;
gpio5.GPIO_n.$assign = "EPWM2_A";

gpio6.$name          = "CAPTURE_EPWM2B";
gpio6.rx             = true;
gpio6.GPIO_n.$assign = "EPWM2_B";

gpio7.$name          = "CAPTURE_EPWM3A";
gpio7.rx             = true;
gpio7.GPIO_n.$assign = "EPWM3_A";

gpio8.$name          = "CAPTURE_EPWM3B";
gpio8.rx             = true;
gpio8.GPIO_n.$assign = "EPWM3_B";

gpio9.$name          = "CAPTURE_EPWM4A";
gpio9.rx             = true;
gpio9.GPIO_n.$assign = "EPWM4_A";

gpio10.$name          = "SYNC_EPWM0";
gpio10.rx             = true;
gpio10.GPIO_n.$assign = "PR0_PRU1_GPIO18";

gpio11.$name          = "CAPTURE_EPWM4B";
gpio11.rx             = true;
gpio11.GPIO_n.$assign = "EPWM4_B";

gpio12.$name          = "CAPTURE_EPWM5A";
gpio12.rx             = true;
gpio12.GPIO_n.$assign = "EPWM5_A";

gpio13.$name          = "CAPTURE_EPWM5B";
gpio13.rx             = true;
gpio13.GPIO_n.$assign = "EPWM5_B";

gpio14.$name          = "CAPTURE_EPWM6A";
gpio14.rx             = true;
gpio14.GPIO_n.$assign = "EPWM6_A";

gpio15.$name          = "CAPTURE_EPWM6B";
gpio15.rx             = true;
gpio15.GPIO_n.$assign = "EPWM6_B";

gpio16.$name          = "CAPTURE_EPWM7A";
gpio16.rx             = true;
gpio16.GPIO_n.$assign = "EPWM7_A";

gpio17.$name          = "CAPTURE_EPWM7B";
gpio17.rx             = true;
gpio17.GPIO_n.$assign = "EPWM7_B";

gpio18.$name          = "CAPTURE_EPWM13A";
gpio18.rx             = true;
gpio18.GPIO_n.$assign = "EPWM13_A";

gpio19.$name          = "CAPTURE_EPWM13B";
gpio19.rx             = true;
gpio19.GPIO_n.$assign = "EPWM13_B";

gpio20.$name          = "CAPTURE_EPWM14A";
gpio20.rx             = true;
gpio20.GPIO_n.$assign = "EPWM14_A";

gpio21.$name          = "CAPTURE_EPWM14B";
gpio21.rx             = true;
gpio21.GPIO_n.$assign = "EPWM14_B";

gpio22.$name          = "CAPTURE_EPWM15A";
gpio22.rx             = true;
gpio22.GPIO_n.$assign = "EPWM15_A";

gpio23.$name          = "CAPTURE_EPWM15B";
gpio23.rx             = true;
gpio23.GPIO_n.$assign = "EPWM15_B";

