TexasInstruments/mcupsdk-core/test/drivers/tester/am263x-cc/r5fss0-0_freertos/example.syscfg
gpio24.$name          = "CAPTURE_EPWM21A";
gpio24.rx             = true;
gpio24.GPIO_n.$assign = "PR0_MDIO_MDIO";

gpio25.$name          = "CAPTURE_EPWM21B";
gpio25.rx             = true;
gpio25.GPIO_n.$assign = "PR0_MDIO_MDC";

gpio26.$name          = "CAPTURE_EPWM17A";
gpio26.rx             = true;
gpio26.GPIO_n.$assign = "MMC_CLK";

gpio27.$name          = "CAPTURE_EPWM17B";
gpio27.rx             = true;
gpio27.GPIO_n.$assign = "MMC_CMD";

gpio28.$name          = "CAPTURE_EPWM18A";
gpio28.rx             = true;
gpio28.GPIO_n.$assign = "MMC_DAT0";

gpio29.$name          = "CAPTURE_EPWM18B";
gpio29.rx             = true;
gpio29.GPIO_n.$assign = "MMC_DAT1";

gpio30.$name          = "CAPTURE_EPWM19A";
gpio30.rx             = true;
gpio30.GPIO_n.$assign = "MMC_DAT2";

gpio31.$name          = "CAPTURE_EPWM19B";
gpio31.rx             = true;
gpio31.GPIO_n.$assign = "MMC_DAT3";

gpio32.$name          = "CAPTURE_EPWM20A";
gpio32.rx             = true;
gpio32.GPIO_n.$assign = "MMC_SDWP";

gpio33.$name          = "CAPTURE_EPWM20B";
gpio33.rx             = true;
gpio33.GPIO_n.$assign = "MMC_SDCD";

gpio34.$name          = "CAPTURE_EPWM22A";
gpio34.rx             = true;
gpio34.GPIO_n.$assign = "PR0_PRU0_GPIO5";

gpio35.$name          = "CAPTURE_EPWM22B";
gpio35.rx             = true;
gpio35.GPIO_n.$assign = "PR0_PRU0_GPIO9";

gpio36.$name          = "CAPTURE_EPWM23A";
gpio36.rx             = true;
gpio36.GPIO_n.$assign = "PR0_PRU0_GPIO10";

gpio37.$name          = "CAPTURE_EPWM23B";
gpio37.rx             = true;
gpio37.GPIO_n.$assign = "PR0_PRU0_GPIO8";

gpio38.$name          = "CAPTURE_EPWM24A";
gpio38.rx             = true;
gpio38.GPIO_n.$assign = "PR0_PRU0_GPIO6";

gpio39.$name          = "CAPTURE_EPWM24B";
gpio39.rx             = true;
gpio39.GPIO_n.$assign = "PR0_PRU0_GPIO4";

gpio40.$name          = "CAPTURE_EPWM25A";
gpio40.rx             = true;
gpio40.GPIO_n.$assign = "PR0_PRU0_GPIO0";

gpio41.$name          = "CAPTURE_EPWM25B";
gpio41.rx             = true;
gpio41.GPIO_n.$assign = "PR0_PRU0_GPIO1";

gpio42.$name          = "CAPTURE_EPWM26A";
gpio42.rx             = true;
gpio42.GPIO_n.$assign = "PR0_PRU0_GPIO2";

gpio43.$name          = "CAPTURE_EPWM26B";
gpio43.rx             = true;
gpio43.GPIO_n.$assign = "PR0_PRU0_GPIO3";

gpio44.$name          = "CAPTURE_EPWM27A";
gpio44.rx             = true;
gpio44.GPIO_n.$assign = "RGMII1_TX_CTL";

gpio45.$name          = "CAPTURE_EPWM27B";
gpio45.rx             = true;
gpio45.GPIO_n.$assign = "PR0_PRU0_GPIO15";

gpio46.$name          = "CAPTURE_EPWM28A";
gpio46.rx             = true;
gpio46.GPIO_n.$assign = "PR0_PRU0_GPIO11";

gpio47.$name          = "CAPTURE_EPWM28B";
gpio47.rx             = true;
gpio47.GPIO_n.$assign = "PR0_PRU0_GPIO12";

gpio48.$name          = "CAPTURE_EPWM29A";
gpio48.rx             = true;
gpio48.GPIO_n.$assign = "PR0_PRU0_GPIO13";

gpio49.$name          = "CAPTURE_EPWM29B";
gpio49.rx             = true;
gpio49.GPIO_n.$assign = "PR0_PRU0_GPIO14";

gpio50.$name          = "CAPTURE_EPWM30A";
gpio50.rx             = true;
gpio50.GPIO_n.$assign = "PR0_PRU1_GPIO5";

gpio51.$name          = "CAPTURE_EPWM30B";
gpio51.rx             = true;
gpio51.GPIO_n.$assign = "PR0_PRU1_GPIO9";

gpio52.$name          = "CAPTURE_EPWM31A";
gpio52.rx             = true;
gpio52.GPIO_n.$assign = "PR0_PRU1_GPIO10";

gpio53.$name          = "CAPTURE_EPWM31B";
gpio53.rx             = true;
gpio53.GPIO_n.$assign = "PR0_PRU1_GPIO8";

gpio54.$name          = "GPIO_17";
gpio54.rx             = true;
gpio54.GPIO_n.$assign = "SPI1_D0";

gpio55.$name          = "GPIO_18";
gpio55.rx             = true;
gpio55.GPIO_n.$assign = "SPI1_D1";

gpio56.$name          = "GPIO_16";
gpio56.rx             = true;
gpio56.GPIO_n.$assign = "SPI1_CLK";

gpio57.$name          = "GPIO_24_LOOPBACK1";
gpio57.rx             = true;
gpio57.GPIO_n.$assign = "I2C1_SDA";

gpio58.$name          = "GPIO_23_LOOPBACK1";
gpio58.rx             = true;
gpio58.GPIO_n.$assign = "I2C1_SCL";

gpio59.$name          = "CAPTURE_EPWM16A";
gpio59.rx             = true;
gpio59.GPIO_n.$assign = "UART1_RXD";

gpio60.$name          = "CAPTURE_EPWM16B";
gpio60.rx             = true;
gpio60.GPIO_n.$assign = "UART1_TXD";

gpio61.$name          = "CAPTURE_EPWM11A";
gpio61.rx             = true;
gpio61.GPIO_n.$assign = "EPWM11_A";

uart1.$name            = "TESTER_UART";
uart1.UART.$assign     = "UART3";
uart1.UART.RXD.pu_pd   = "pu";
uart1.UART.RXD.$assign = "SPI0_CS0";
uart1.UART.TXD.pu_pd   = "pu";
uart1.UART.TXD.$assign = "SPI0_CLK";
uart1.child.$name      = "drivers_uart_v2_uart_v2_template0";

debug_log.enableUartLog            = true;
debug_log.enableCssLog             = false;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template1";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

default_linker1.$name = "memory_configurator_default_linker0";

general1.$name        = "CONFIG_GENERAL0";
general1.linker.$name = "TIARMCLANG0";

region1.$name                                = "MEMORY_REGION_CONFIGURATION0";
region1.memory_region.create(11);
region1.memory_region[0].type                = "TCMA";
region1.memory_region[0].$name               = "R5F_VECS";
region1.memory_region[0].size                = 0x40;
region1.memory_region[0].auto                = false;
region1.memory_region[1].type                = "TCMA";
region1.memory_region[1].$name               = "R5F_TCMA";
region1.memory_region[1].size                = 0x7FC0;
region1.memory_region[2].type                = "TCMB";
region1.memory_region[2].size                = 0x8000;
region1.memory_region[2].$name               = "R5F_TCMB";
region1.memory_region[3].$name               = "SBL";
region1.memory_region[3].auto                = false;
region1.memory_region[3].size                = 0x40000;
region1.memory_region[4].$name               = "OCRAM";
region1.memory_region[4].auto                = false;
region1.memory_region[4].manualStartAddress  = 0x70040000;
region1.memory_region[4].size                = 0x40000;
region1.memory_region[5].type                = "FLASH";
region1.memory_region[5].auto                = false;
region1.memory_region[5].size                = 0x80000;
region1.memory_region[5].$name               = "FLASH";
region1.memory_region[6].$name               = "USER_SHM_MEM";
region1.memory_region[6].auto                = false;
region1.memory_region[6].manualStartAddress  = 0x701D0000;
region1.memory_region[6].size                = 0x4000;
region1.memory_region[6].isShared            = true;
region1.memory_region[6].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[7].$name               = "LOG_SHM_MEM";
region1.memory_region[7].auto                = false;
region1.memory_region[7].manualStartAddress  = 0x701D4000;
region1.memory_region[7].size                = 0x4000;
region1.memory_region[7].isShared            = true;
region1.memory_region[7].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[8].type                = "CUSTOM";
region1.memory_region[8].$name               = "RTOS_NORTOS_IPC_SHM_MEM";
region1.memory_region[8].auto                = false;
region1.memory_region[8].manualStartAddress  = 0x72000000;
region1.memory_region[8].size                = 0x3E80;
region1.memory_region[8].isShared            = true;
region1.memory_region[8].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[9].type                = "CUSTOM";
region1.memory_region[9].$name               = "MAILBOX_HSM";
region1.memory_region[9].auto                = false;
region1.memory_region[9].manualStartAddress  = 0x44000000;
region1.memory_region[9].size                = 0x3CE;
region1.memory_region[9].isShared            = true;
region1.memory_region[9].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[10].type               = "CUSTOM";
region1.memory_region[10].$name              = "MAILBOX_R5F";
region1.memory_region[10].auto               = false;
region1.memory_region[10].manualStartAddress = 0x44000400;
region1.memory_region[10].size               = 0x3CE;
region1.memory_region[10].isShared           = true;
region1.memory_region[10].shared_cores       = ["r5fss0-1","r5fss1-0","r5fss1-1"];

